Tekla Open API Reference for Tekla Structures 2025
FormatTypes Enumeration
 The available format types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum FormatTypes
Public Enumeration FormatTypes
Members
Member name | Value | Description
Automatic | 0 | Automatic, chooses the most appropriate format for the current environment.
WholeNumber | 1 | As shown on the dialog: ###. This format will not show fractions or decimals.
OneDecimalIfValidDecimal | 2 | As shown on the dialog: ###.[#]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.
OneDecimal | 3 | As shown on the dialog: ###.#. This format will always show the value with one decimal.
TwoDecimalsIfValidDecimals | 4 | As shown on the dialog: ###.[##]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.
TwoDecimals | 5 | As shown on the dialog: ###.##. This format will always show the value with two decimals.
ThreeDecimalsIfValidDecimals | 6 | As shown on the dialog: ###.[###]. This format will not show fractions or decimals, unless the rounded decimal part is a non zero value.
ThreeDecimals | 7 | As shown on the dialog: ###.###. This format will always show the value with three decimals.
Fractional | 8 | As shown on the dialog: ### #/#. This format will always show the value with fractions.
See Also
Reference
Tekla.Structures.Drawing Namespace